Процедура ПередЗаписью(Отказ)
	ПраваДокументации.ПроверитьЗапись(ЭтотОбъект);
	КонтрольВыпуска.ПроверитьЗависимость(Ссылка);

	Наименование = СокрЛП(Наименование);
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		ВызватьИсключение "Укажите название документа.";
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Продукт) Тогда
		ВызватьИсключение "Выберите продукт, к которому относится документ.";
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВидДокументации) Тогда
		ВызватьИсключение "Выберите вид документации.";
	КонецЕсли;

	КонтрольКомплектов.ПроверитьИзменениеПродуктаДокумента(ЭтотОбъект);
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	ПраваДокументации.ПроверитьУдаление(ЭтотОбъект);
	КонтрольВыпуска.ПроверитьЗависимость(Ссылка);
КонецПроцедуры
