Процедура ПриНачалеРаботыСистемы()

	Параметры = СтрРазделить(ПараметрЗапуска, "|", Ложь);
	Если Параметры.Количество() = 4 Тогда
		Если Параметры[0] = "DocReleaseBootstrap" Тогда
			Попытка
				СервисПрототипа.ПодготовитьИПроверитьПрототип(Параметры[1], Параметры[2], Параметры[3]);
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
			ЗавершитьРаботуСистемы(Ложь);
		ИначеЕсли Параметры[0] = "DocReleaseReview" Тогда
			Попытка
				КонтрольДокументации.ПодготовитьИПроверитьСогласование(Параметры[1], Параметры[2], Параметры[3]);
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
			ЗавершитьРаботуСистемы(Ложь);
		ИначеЕсли Параметры[0] = "DocReleasePlan" Тогда
			Попытка
				ПроверкиКомплектов.ЗапуститьПроверкиПлана(Параметры[1], Параметры[2], Параметры[3]);
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
			ЗавершитьРаботуСистемы(Ложь);
		ИначеЕсли Параметры[0] = "DocReleaseReadiness" Тогда
			Попытка
				ПроверкиГотовности.ЗапуститьПроверкиГотовности(Параметры[1], Параметры[2], Параметры[3]);
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
			ЗавершитьРаботуСистемы(Ложь);
		ИначеЕсли Параметры[0] = "DocReleaseRelease" Тогда
			Попытка
				ПроверкиВыпуска.ЗапуститьПроверкиВыпуска(Параметры[1], Параметры[2], Параметры[3]);
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
			ЗавершитьРаботуСистемы(Ложь);
		ИначеЕсли Параметры[0] = "DocReleaseReports" Тогда
			Попытка
				ПроверкиОтчетов.ЗапуститьПроверкиОтчетов(Параметры[1], Параметры[2], Параметры[3]);
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
			ЗавершитьРаботуСистемы(Ложь);
		ИначеЕсли Параметры[0] = "DocReleaseRolesSetup" Тогда
			Попытка
				ПроверкиПрав.ПодготовитьПользователей(Параметры[1], Параметры[2], Параметры[3]);
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
			ЗавершитьРаботуСистемы(Ложь);
		ИначеЕсли Параметры[0] = "DocReleaseRolesUser" Тогда
			Попытка
				ПроверкиПрав.ЗапуститьПодПользователем(Параметры[1], Параметры[2], Параметры[3]);
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
			ЗавершитьРаботуСистемы(Ложь);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
