Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СервисОтчетов.СформироватьПоНастройкам("ИсторияРедакции", КомпоновщикНастроек.ПолучитьНастройки(), ДокументРезультат, ДанныеРасшифровки);
КонецПроцедуры

Функция СформироватьДляПараметров(Параметры = Неопределено) Экспорт
	Настройки = СервисОтчетов.НастройкиПоПараметрам("ИсторияРедакции", Параметры);
	ДокументРезультат = Новый ТабличныйДокумент;
	СервисОтчетов.СформироватьПоНастройкам("ИсторияРедакции", Настройки, ДокументРезультат);
	Возврат ДокументРезультат;
КонецФункции
