Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ПраваДокументации.ПроверитьЗапись(ЭтотОбъект);
	КонтрольВыпуска.ПроверитьЗависимость(Ссылка);
	КонтрольДокументации.ПроверитьЗаписьПроведённого(ЭтотОбъект, РежимЗаписи, "Дата,Редакция,Проверяющий,СсылкаНаТекст,ИдентификаторСодержимого");
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если Не ЗначениеЗаполнено(Редакция) Или Не ЗначениеЗаполнено(Проверяющий) Тогда
			ВызватьИсключение "Укажите редакцию и назначенного проверяющего.";
		КонецЕсли;
		СсылкаНаТекст = Редакция.СсылкаНаТекст;
		ИдентификаторСодержимого = Редакция.ИдентификаторСодержимого;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	КонтрольДокументации.ПровестиПередачу(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	КонтрольДокументации.ПроверитьПоследующиеПередаче(Ссылка);
	КонтрольДокументации.ПроверитьПоследнююОперацию(ЭтотОбъект, Редакция);
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	ПраваДокументации.ПроверитьУдаление(ЭтотОбъект);
	КонтрольВыпуска.ПроверитьЗависимость(Ссылка);
КонецПроцедуры
